# ==========================================
# 游꽄 BREWFILE MAESTRO - Configuraci칩n Mac
# ==========================================

tap "homebrew/services" # Permite correr bases de datos (MySQL) en segundo plano

# ------------------------------------------
# 游 HERRAMIENTAS MODERNAS (Superpoderes CLI)
# ------------------------------------------
brew "bat"          # Un 'cat' mejorado: con colores y n칰meros de l칤nea
brew "eza"          # Un 'ls' moderno: con iconos, colores y mejor formato
brew "zoxide"       # Un 'cd' inteligente: aprende tus carpetas m치s usadas
brew "ripgrep"      # Buscador de texto ultrarr치pido (reemplaza a grep)
brew "fd"           # Buscador de archivos r치pido y amigable (reemplaza a find)
brew "lazygit"      # Interfaz gr치fica incre칤ble para Git dentro de la terminal
brew "thefuck"      # Corrige tus errores de comandos autom치ticamente
brew "btop"         # Monitor de sistema visual (CPU, RAM, Red)
brew "tldr"         # Manuales de comandos simplificados con ejemplos
brew "fastfetch"    # Muestra informaci칩n del sistema y el logo (est칠tico)
brew "fzf"          # Buscador difuso (Ctrl+R para historial)

# ------------------------------------------
# 游 HERRAMIENTAS ESENCIALES
# ------------------------------------------
brew "git"
brew "wget"         # Descargar archivos de internet
brew "tree"         # Ver estructura de carpetas en 치rbol
brew "vim"
brew "jq"           # Procesar y leer archivos JSON
brew "cmake"        # Compilador necesario para muchas herramientas
brew "mysql", restart_service: :changed

# ------------------------------------------
# 游냀 LENGUAJES DE PROGRAMACI칍N
# ------------------------------------------
brew "go"
brew "python@3.12"
brew "pipx"         # Para instalar aplicaciones Python aisladas

# ------------------------------------------
# 游둰 APLICACIONES DE ESCRITORIO (CASKS)
# ------------------------------------------
cask "visual-studio-code"
cask "discord"
cask "font-fira-code-nerd-font" # Fuente recomendada para ver los iconos en terminal

# ------------------------------------------
# 游 VS CODE EXTENSIONS (Limpias y Organizadas)
# ------------------------------------------

# >> Est칠tica e Iconos
vscode "pkief.material-icon-theme"
vscode "zhuangtongfa.material-theme"
vscode "naumovs.color-highlight"
vscode "usernamehw.errorlens"  # Muestra el error en la misma l칤nea de c칩digo

# >> Inteligencia Artificial
vscode "github.copilot"
vscode "github.copilot-chat"

# >> Web (HTML/CSS/JS/React)
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "bradlc.vscode-tailwindcss"
vscode "ritwickdey.liveserver"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"

# >> Backend & Data
vscode "rangav.vscode-thunder-client"    # Cliente API (Tipo Postman)
vscode "cweijan.vscode-mysql-client2"    # El mejor cliente de Bases de Datos

# >> Python
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"              # Notebooks

# >> Otros Lenguajes (.NET / Docker / C++)
vscode "ms-dotnettools.csharp"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.cpptools-extension-pack"

# >> Utilidades
vscode "ms-vscode-remote.vscode-remote-extensionpack" # SSH y WSL
vscode "formulahendry.code-runner"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-spanish"
vscode "ms-ceintl.vscode-language-pack-es"